In [1]:
import pandas as pd

In [2]:
info = {
    "Name" : ["Abhishek","Amit","Sumit"],
    "CGPA" : [9,9.5,9.8]
    
}
df = pd.DataFrame(info)
print(df)

       Name  CGPA
0  Abhishek   9.0
1      Amit   9.5
2     Sumit   9.8

In [3]:
df

       Name  CGPA
0  Abhishek   9.0
1      Amit   9.5
2     Sumit   9.8

In [4]:
s = pd.Series([1,2,3,4,5])
print(s)
print(type(s))

#index
print(s[0])
print(s[2])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
3

In [5]:
s = pd.Series([23,24,25,26], index = ["A","B","C","D"])
print(s)

print(s["A"])
print(s["B"])
print(s[0])

A    23
B    24
C    25
D    26
dtype: int64
23
24
23

C:\Users\HP\AppData\Local\Temp\ipykernel_18556\1626159248.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [6]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])

print(s1+s2)
s1[0] = 100

changed_s1 = s1.drop(0)
print(s1)
print(changed_s1)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
info = {
    "Name" : ["A","B","C"],
    "Age" : [23,24,24],
    "CGPA" : [7,8,9]
}

df = pd.DataFrame(info)
print(df, type(df))

print(df.index)
print(df.columns)

  Name  Age  CGPA
0    A   23     7
1    B   24     8
2    C   24     9 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [8]:
import numpy as np

arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr , columns = ["A","B","C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [9]:
#csv data
df = pd.read_csv("employee_data.csv")
# print(df, type(df))

#DataFrame method
# print(df.head())
# print(df.tail())
# print(df.sample())
# print(df.info())
# print(df.shape)
# print(df.describe())
print(df.columns)
print(df.nunique())

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')
ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [10]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [11]:
# #json data
# df = pd.read_json("employee_data.json")
# print(df, type(df))

In [15]:
df = pd.read_csv("globalAirQuality.csv")

# df.head()
# df.tail()
df.describe()

,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
count,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000
mean,23.065980,37.655560,40.369131,70.152228,32.055176,6.035508,48.065100,0.800595,104.645556,21.510251,57.714351,5.283910
std,26.156536,78.600701,17.647450,24.999440,13.820680,2.454790,14.950849,0.250254,25.616070,9.509444,18.844908,2.741712
min,-37.814000,-123.121000,0.025000,0.061000,0.013000,0.003000,0.114000,0.000000,16.000000,5.000000,25.002000,0.500000
25%,12.972000,2.352000,27.904500,53.125500,22.362500,4.360750,38.028500,0.633000,87.000000,13.357750,41.320000,2.937000
50%,29.232000,42.146000,40.286500,69.961000,32.019500,6.026000,48.142000,0.800500,103.000000,21.455500,57.847000,5.297000
75%,41.008000,103.820000,52.436250,87.256500,41.364250,7.715250,58.258500,0.969000,121.000000,29.688250,74.234750,7.662000
max,60.170000,174.763000,115.683000,161.810000,90.019000,16.559000,103.016000,1.832000,231.000000,37.998000,89.997000,9.999000